import host from "./index";

/**************************************************************
 * Создание нового тега
 **************************************************************/
// TODO: не используется
export const addTag = async (id) => {
    const {data} = await host.post(`api/tag`, {id})
    return data
}

/**************************************************************
 * Получение всех тегов
 **************************************************************/
export const getTags = async () => {
    const {data} = await host.get(`api/tag`)
    return data
}

/**************************************************************
 * Получение тега по id
 **************************************************************/
// TODO: не используется
export const getIdTag = async (id) => {
    const {data} = await host.get(`api/tag/${id}`)
    return data
}


/**************************************************************
 * Обновление данных тега по id
 **************************************************************/
// TODO: не используется
export const putIdTag = async (id) => {
    const {data} = await host.put(`api/tag/${id}`)
    return data
}


/**************************************************************
 * Удаление тега по id
 **************************************************************/
// TODO: не используется
export const deleteIdTag = async (id) => {
    const {data} = await host.delete(`api/tag/${id}`)
    return data
}